# Pandas week 3

# 9. Membagi Data Frame menjadi dua secara acak

In [ ]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(np.__version__)

In [ ]:
#Data Frame Prep
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,25, size=(n_rows, n_cols)),
                 columns=cols)

df

# Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentu

In [ ]:
df.shape#menghitung jumlas baris dan kolom (kanan baris dan kiri kolom )

In [ ]:
#membagi data Frame
proporsi= 0.8 #80% data pertama dan sisanya untuk data kedua
df_1 = df.sample(frac=proporsi)
#df.sample(): method yang mengambil baris secara acak sesuai nilai parameter fracnya
df_2 = df.drop(df_1.index)#--> isinya menghapus baris yang sudah ada di df_1 (sisa data dari df_1)

print(f'df_1shape: {df_1.shape}')
print(f'df_2shape: {df_2.shape}')

In [ ]:
# isi df_1
df_1

In [ ]:
#isi df_2
df_2

# 10. Mengganti nama kolom pada Data Frame berdasarkan pola

In [26]:
#import modules
import pandas as pd
import numpy as np 
import os

#check Version
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [34]:
df = pd.read_csv('C:/Users/Markvinson/Visualisasi data/Pandas/data/data/titanicfull.csv')
df.columns= ['Pclass', 'Survival Status', 'Full Name','Sex',' Age',
            'Sib SP', 'Parch', 'Ticket','Fare', 'Cabin', 'Embarked']

df_backup=df.copy(deep=True)
df.head()

,Pclass,Survival Status,Full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S